stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_rng.h
/**
  ******************************************************************************
  * @file    stm32wb0x_ll_rng.h
  * @author  MCD Application Team
  * @brief   Header file of RNG LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WB0x_LL_RNG_H
#define STM32WB0x_LL_RNG_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x.h"

/** @addtogroup STM32WB0x_LL_Driver
  * @{
  */

#if defined (RNG)
/** @defgroup RNG_LL RNG
  * @{
  */
#if defined (STM32WB09)

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RNG_LL_ES_Init_Struct RNG Exported Init structures
  * @{
  */

/**
  * @brief LL RNG Init Structure Definition
  */
typedef struct
{
  uint32_t         SamplingClockDivider; /*!< TRNG includes an internal clock enable divider that can be set by bits
                                              CLKDIV0 to CLKDIV15 of TRNG_CR register.
                                              It is used for decreasing internal random source sampling. Before
                                              changing the clock divider, it is recommended
                                              to disable the TRNG bit setting bit DISABLE to 1.
                                              This parameter can be one value being in the range of 0 to 65535.
                                              This parameter can be modified using unitary functions @ref
                                              LL_RNG_SetSamplingClockEnableDivider(). */
} LL_RNG_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/** @defgroup RNG_LL_DISABLE Values
  * @{
 */
#define LL_RNG_CR_DISABLE_0                                (0U)
#define LL_RNG_CR_DISABLE_1                                (RNG_CR_DISABLE)
/**
  * @}
  */

/** @defgroup RNG_LL_CLR_REVCLK_FLAG Values
  * @{
 */
#define LL_RNG_CR_CLR_REVCLK_FLAG_0                        (0U)
#define LL_RNG_CR_CLR_REVCLK_FLAG_1                        (RNG_CR_CLR_REVCLK_FLAG)
/**
  * @}
  */

/** @defgroup RNG_LL_RST_HEALTH_FLAGS Values
  * @{
 */
#define LL_RNG_CR_RST_HEALTH_FLAGS_0                       (0U)
#define LL_RNG_CR_RST_HEALTH_FLAGS_1                       (RNG_CR_RST_HEALTH_FLAGS)
/**
  * @}
  */


/** @defgroup RNG_LL_BP_POSTP Values
  * @{
 */
#define LL_RNG_CR_BP_POSTP_0                               (0U)
#define LL_RNG_CR_BP_POSTP_1                               (RNG_CR_BP_POSTP)
/**
  * @}
  */

/** @defgroup RNG_LL_DISABLED Values
  * @{
 */
#define LL_RNG_SR_DISABLED_0                               (0U)
#define LL_RNG_SR_DISABLED_1                               (RNG_SR_DISABLED)
/**
  * @}
  */

/** @defgroup RNG_LL_ALL_OSCS_DOWN Values
  * @{
 */
#define LL_RNG_SR_ALL_OSCS_DOWN_0                          (0U)
#define LL_RNG_SR_ALL_OSCS_DOWN_1                          (RNG_SR_ALL_OSCS_DOWN)
/**
  * @}
  */

/** @defgroup RNG_LL_REVEAL_CLK_ERR Values
  * @{
 */
#define LL_RNG_SR_REVEAL_CLK_ERR_0                         (0U)
#define LL_RNG_SR_REVEAL_CLK_ERR_1                         (RNG_SR_REVEAL_CLK_ERR)
/**
  * @}
  */

/** @defgroup RNG_LL_ENTROPY_ERR Values
  * @{
 */
#define LL_RNG_SR_ENTROPY_ERR_0                            (0U)
#define LL_RNG_SR_ENTROPY_ERR_1                            (RNG_SR_ENTROPY_ERR)
/**
  * @}
  */

/** @defgroup RNG_LL_VAL_READY Values
  * @{
 */
#define LL_RNG_SR_VAL_READY_0                              (0U)
#define LL_RNG_SR_VAL_READY_1                              (RNG_SR_VAL_READY)
/**
  * @}
  */

/** @defgroup RNG_LL_FIFO_FULL Values
  * @{
 */
#define LL_RNG_SR_FIFO_FULL_0                              (0U)
#define LL_RNG_SR_FIFO_FULL_1                              (RNG_SR_FIFO_FULL)
/**
  * @}
  */

/** @defgroup RNG_LL_SRC_HEALTH_DONE Values
  * @{
 */
#define LL_RNG_SR_SRC_HEALTH_DONE_0                        (0U)
#define LL_RNG_SR_SRC_HEALTH_DONE_1                        ( RNG_SR_SRC_HEALTH_DONE)
/**
  * @}
  */

/** @defgroup RNG_LL_REPET_ERROR Values
  * @{
 */
#define LL_RNG_SR_REPET_ERROR_0                            (0U)
#define LL_RNG_SR_REPET_ERROR_1                            (RNG_SR_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_SR_ADAPT_ERROR_0                            (0U)
#define LL_RNG_SR_ADAPT_ERROR_1                            (RNG_SR_ADAPT_ERROR_0)
/**
  * @}
  */

/** @defgroup RNG_LL_OSCS_HEALTH_DONE Values
  * @{
 */
#define LL_RNG_SR_OSCS_HEALTH_DONE_0                       (0U)
#define LL_RNG_SR_OSCS_HEALTH_DONE_1                       (RNG_SR_OSCS_HEALTH_DONE)
/**
  * @}
  */

/** @defgroup RNG_LL_OSCS_REPET_ERROR Values
  * @{
 */
#define LL_RNG_SR_OSCS_REPET_ERROR_0                       (0U)
#define LL_RNG_SR_OSCS_REPET_ERROR_1                       (RNG_SR_OSCS_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_OSCS_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_SR_OSCS_ADAPT_ERROR_0                       (0U)
#define LL_RNG_SR_OSCS_ADAPT_ERROR_1                       ( RNG_SR_OSCS_ADAPT_ERROR)
/**
  * @}
  */


/** @defgroup RNG_LL_PWRD1 Values
  * @{
 */
#define LL_RNG_OSCS_CR_PWRD1_0                             (0U)
#define LL_RNG_OSCS_CR_PWRD1_1                             (RNG_OSCS_CR_PWRD1_0)
#define LL_RNG_OSCS_CR_PWRD1_2                             (RNG_OSCS_CR_PWRD1_1)
#define LL_RNG_OSCS_CR_PWRD1_3                             (RNG_OSCS_CR_PWRD1_1 | RNG_OSCS_CR_PWRD1_0)
#define LL_RNG_OSCS_CR_PWRD1_4                             (RNG_OSCS_CR_PWRD1_2)
#define LL_RNG_OSCS_CR_PWRD1_5                             (RNG_OSCS_CR_PWRD1_2 | RNG_OSCS_CR_PWRD1_0)
#define LL_RNG_OSCS_CR_PWRD1_6                             (RNG_OSCS_CR_PWRD1_2 | RNG_OSCS_CR_PWRD1_1)
#define LL_RNG_OSCS_CR_PWRD1_7                             (RNG_OSCS_CR_PWRD1_2 |\
                                                            RNG_OSCS_CR_PWRD1_1 | RNG_OSCS_CR_PWRD1_0)
/**
  * @}
  */

