stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_rng.h
/** @defgroup RNG_LL_PWRD2 Values
  * @{
 */
#define LL_RNG_OSCS_CR_PWRD2_0                             (0U)
#define LL_RNG_OSCS_CR_PWRD2_1                             (RNG_OSCS_CR_PWRD2_0)
#define LL_RNG_OSCS_CR_PWRD2_2                             (RNG_OSCS_CR_PWRD2_1)
#define LL_RNG_OSCS_CR_PWRD2_3                             (RNG_OSCS_CR_PWRD2_1 | RNG_OSCS_CR_PWRD2_0)
#define LL_RNG_OSCS_CR_PWRD2_4                             ( RNG_OSCS_CR_PWRD2_2)
#define LL_RNG_OSCS_CR_PWRD2_5                             ( RNG_OSCS_CR_PWRD2_2 | RNG_OSCS_CR_PWRD2_0)
#define LL_RNG_OSCS_CR_PWRD2_6                             ( RNG_OSCS_CR_PWRD2_2 | RNG_OSCS_CR_PWRD2_1)
#define LL_RNG_OSCS_CR_PWRD2_7                             ( RNG_OSCS_CR_PWRD2_2 |\
                                                             RNG_OSCS_CR_PWRD2_1 | RNG_OSCS_CR_PWRD2_0  )
/**
  * @}
  */

/** @defgroup RNG_LL_PWRD3 Values
  * @{
 */
#define LL_RNG_OSCS_CR_PWRD3_0                             (0U)
#define LL_RNG_OSCS_CR_PWRD3_1                             (RNG_OSCS_CR_PWRD3_0)
#define LL_RNG_OSCS_CR_PWRD3_2                             (RNG_OSCS_CR_PWRD3_1)
#define LL_RNG_OSCS_CR_PWRD3_3                             (RNG_OSCS_CR_PWRD3_1 | RNG_OSCS_CR_PWRD3_0)
#define LL_RNG_OSCS_CR_PWRD3_4                             (RNG_OSCS_CR_PWRD3_2)
#define LL_RNG_OSCS_CR_PWRD3_5                             (RNG_OSCS_CR_PWRD3_2 | RNG_OSCS_CR_PWRD3_0)
#define LL_RNG_OSCS_CR_PWRD3_6                             (RNG_OSCS_CR_PWRD3_2 | RNG_OSCS_CR_PWRD3_1)
#define LL_RNG_OSCS_CR_PWRD3_7                             (RNG_OSCS_CR_PWRD3_2 |\
                                                            RNG_OSCS_CR_PWRD3_1 | RNG_OSCS_CR_PWRD3_0)
/**
  * @}
  */

/** @defgroup RNG_LL_SYNC_OSCS Values
  * @{
 */
#define LL_RNG_OSCS_CR_SYNC_OSCS_0                         (0U)
#define LL_RNG_OSCS_CR_SYNC_OSCS_1                         (RNG_OSCS_CR_SYNC_OSCS)
/**
  * @}
  */

/** @defgroup RNG_LL_AES_RESET Values
  * @{
 */
#define LL_RNG_POSTP_CR_AES_RESET_0                        (0U)
#define LL_RNG_POSTP_CR_AES_RESET_1                        (RNG_POSTP_CR_AES_RESET)
/**
  * @}
  */

/** @defgroup RNG_LL_NB_LOOP_AES Values
  * @{
 */
#define LL_RNG_POSTP_CR_NB_LOOP_AES_0                      (0U)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_1                      (RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_2                      (RNG_POSTP_CR_NB_LOOP_AES_1)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_3                      (RNG_POSTP_CR_NB_LOOP_AES_1 | RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_4                      (RNG_POSTP_CR_NB_LOOP_AES_2)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_5                      (RNG_POSTP_CR_NB_LOOP_AES_2 | RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_6                      (RNG_POSTP_CR_NB_LOOP_AES_2 | RNG_POSTP_CR_NB_LOOP_AES_1)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_7                      (RNG_POSTP_CR_NB_LOOP_AES_2 | RNG_POSTP_CR_NB_LOOP_AES_1 |\
                                                            RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_8                      (RNG_POSTP_CR_NB_LOOP_AES_3)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_9                      (RNG_POSTP_CR_NB_LOOP_AES_3 | RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_10                     (RNG_POSTP_CR_NB_LOOP_AES_3 | RNG_POSTP_CR_NB_LOOP_AES_1)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_11                     (RNG_POSTP_CR_NB_LOOP_AES_3 |\
                                                            RNG_POSTP_CR_NB_LOOP_AES_1 | RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_12                     (RNG_POSTP_CR_NB_LOOP_AES_3 | RNG_POSTP_CR_NB_LOOP_AES_2)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_13                     (RNG_POSTP_CR_NB_LOOP_AES_3 |\
                                                            RNG_POSTP_CR_NB_LOOP_AES_2 | RNG_POSTP_CR_NB_LOOP_AES_0)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_14                     (RNG_POSTP_CR_NB_LOOP_AES_3 |\
                                                            RNG_POSTP_CR_NB_LOOP_AES_2 | RNG_POSTP_CR_NB_LOOP_AES_1)
#define LL_RNG_POSTP_CR_NB_LOOP_AES_15                     (RNG_POSTP_CR_NB_LOOP_AES_3 | RNG_POSTP_CR_NB_LOOP_AES_2 |\
                                                            RNG_POSTP_CR_NB_LOOP_AES_1 | RNG_POSTP_CR_NB_LOOP_AES_0)
/**
  * @}
  */


/** @defgroup RNG_LL_AES_INIT Values
  * @{
 */
#define LL_RNG_POSTP_SR_AES_INIT_0                         (0U)
#define LL_RNG_POSTP_SR_AES_INIT_1                         (RNG_POSTP_SR_AES_INIT)
/**
  * @}
  */

/** @defgroup RNG_LL_AES_KEY_LD Values
  * @{
 */
#define LL_RNG_POSTP_SR_AES_KEY_LD_0                       (0U)
#define LL_RNG_POSTP_SR_AES_KEY_LD_1                       (RNG_POSTP_SR_AES_KEY_LD)
/**
  * @}
  */

/** @defgroup RNG_LL_AES_BUSY Values
  * @{
 */
#define LL_RNG_POSTP_SR_AES_BUSY_0                         (0U)
#define LL_RNG_POSTP_SR_AES_BUSY_1                         (RNG_POSTP_SR_AES_BUSY)
/**
  * @}
  */

/** @defgroup RNG_LL_AES_HEALTH_DONE Values
  * @{
 */
#define LL_RNG_POSTP_SR_AES_HEALTH_DONE_0                  (0U)
#define LL_RNG_POSTP_SR_AES_HEALTH_DONE_1                  (RNG_POSTP_SR_AES_HEALTH_DONE)
/**
  * @}
  */

/** @defgroup RNG_LL_AES_K12_ERROR Values
  * @{
 */
#define LL_RNG_POSTP_SR_AES_K12_ERROR_0                    (0U)
#define LL_RNG_POSTP_SR_AES_K12_ERROR_1                    (RNG_POSTP_SR_AES_K12_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_AES_DOUT_ERROR Values
  * @{
 */
#define LL_RNG_POSTP_SR_AES_DOUT_ERROR_0                   (0U)
#define LL_RNG_POSTP_SR_AES_DOUT_ERROR_1                   (RNG_POSTP_SR_AES_DOUT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_ITER_ADAP Values
  * @{
 */
#define LL_RNG_HEALTH_CR_ITER_ADAP_0                       (0U)
#define LL_RNG_HEALTH_CR_ITER_ADAP_1                       (RNG_HEALTH_CR_ITER_ADAP_0)
#define LL_RNG_HEALTH_CR_ITER_ADAP_2                       (RNG_HEALTH_CR_ITER_ADAP_1)
#define LL_RNG_HEALTH_CR_ITER_ADAP_3                       (RNG_HEALTH_CR_ITER_ADAP_1 | RNG_HEALTH_CR_ITER_ADAP_0)
/**
  * @}
  */

/** @defgroup RNG_LL_TO1_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_1            (RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_0)
/**
  * @}
  */

/** @defgroup RNG_LL_TO1_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_1            (RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO2_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_1            (RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO2_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_1            (RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO3_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_1            (RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO3_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_1            (RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO1_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_1            (RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO1_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_1            (RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO2_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_1            (RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO2_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_1            (RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO3_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_1            (RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO3_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_1            (RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO1_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC3_SR_TO1_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC3_SR_TO1_REPET_ERROR_1            (RNG_HEALTH_OSC3_SR_TO1_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO1_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC3_SR_TO1_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC3_SR_TO1_ADAPT_ERROR_1            (RNG_HEALTH_OSC3_SR_TO1_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO2_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC3_SR_TO2_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC3_SR_TO2_REPET_ERROR_1            (RNG_HEALTH_OSC3_SR_TO2_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO2_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC3_SR_TO2_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC3_SR_TO2_ADAPT_ERROR_1            (RNG_HEALTH_OSC3_SR_TO2_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO3_REPET_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC3_SR_TO3_REPET_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC3_SR_TO3_REPET_ERROR_1            (RNG_HEALTH_OSC3_SR_TO3_REPET_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_TO3_ADAPT_ERROR Values
  * @{
 */
#define LL_RNG_HEALTH_OSC3_SR_TO3_ADAPT_ERROR_0            (0U)
#define LL_RNG_HEALTH_OSC3_SR_TO3_ADAPT_ERROR_1            (RNG_HEALTH_OSC3_SR_TO3_ADAPT_ERROR)
/**
  * @}
  */

/** @defgroup RNG_LL_EN_FF_FULL_IRQ Values
  * @{
 */
#define LL_RNG_IRQ_CR_EN_FF_FULL_IRQ_0                     (0U)
#define LL_RNG_IRQ_CR_EN_FF_FULL_IRQ_1                     (RNG_IRQ_CR_EN_FF_FULL_IRQ)
/**
  * @}
  */

