stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_rng.h
/** @defgroup RNG_LL_EN_ERROR_IRQ Values
  * @{
 */
#define LL_RNG_IRQ_CR_EN_ERROR_IRQ_0                       (0U)
#define LL_RNG_IRQ_CR_EN_ERROR_IRQ_1                       (RNG_IRQ_CR_EN_ERROR_IRQ)
/**
  * @}
  */

/** @defgroup RNG_LL_FF_FULL_IRQ Values
  * @{
 */
#define LL_RNG_IRQ_SR_FF_FULL_IRQ_0                        (0U)
#define LL_RNG_IRQ_SR_FF_FULL_IRQ_1                        (RNG_IRQ_SR_FF_FULL_IRQ)
/**
  * @}
  */

/** @defgroup RNG_LL_ERROR_IRQ Values
  * @{
 */
#define LL_RNG_IRQ_SR_ERROR_IRQ_0                          (0U)
#define LL_RNG_IRQ_SR_ERROR_IRQ_1                          (RNG_IRQ_SR_ERROR_IRQ)
/**
  * @}
  */


/**
  * @brief  Enable Random Number Generation
  * @rmtoll CR           RNG_DIS         LL_RNG_Enable
  * @param  RNGx RNG Instance
  * @retval None
  */
__STATIC_INLINE void LL_RNG_Enable(RNG_TypeDef *RNGx)
{
  MODIFY_REG(RNGx->CR, RNG_CR_DISABLE, LL_RNG_CR_DISABLE_0);
}

/**
  * @brief  Disable Random Number Generation
  * @rmtoll CR           RNG_DIS         LL_RNG_Disable
  * @param  RNGx RNG Instance
  * @retval None
  */
__STATIC_INLINE void LL_RNG_Disable(RNG_TypeDef *RNGx)
{
  MODIFY_REG(RNGx->CR, RNG_CR_DISABLE, LL_RNG_CR_DISABLE_1);
}

/**
  * @brief  When writing a 1, the value remains until it is seen by RNG core clock domain after
  resynchronization. Then it is automatically reset
  * @note   0x0 no reset
            0x1 reset revclk flag
  * @rmtoll CR          CLR_REVCLK_FLAG       LL_RNG_SetResetRevealClockErrorFlags
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_CR_CLR_REVCLK_FLAG_0
  *         @arg LL_RNG_CR_CLR_REVCLK_FLAG_1
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetResetRevealClockErrorFlags(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->CR, RNG_CR_CLR_REVCLK_FLAG, value);
}

/**
  * @brief  Get the Reset Reveal Clock Error Flag
  * @note   0x0 no reset
  *         0x1 reset revclk flag
  * @rmtoll CR          CLR_REVCLK_FLAG       LL_RNG_GetResetRevealClockErrorFlags
  * @retval can be one of the following values
  *         @arg LL_RNG_CR_CLR_REVCLK_FLAG_0
  *         @arg LL_RNG_CR_CLR_REVCLK_FLAG_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetResetRevealClockErrorFlags(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->CR, RNG_CR_CLR_REVCLK_FLAG));
}

/**
  * @brief  Set the Reset Health Error Flag
    @note   When writing a 1, the value remains until it is seen by RNG core clock domain after resynchronization.
        Then it is automatically reset
            0x0 no reset
            0x1 reset health flag
  * @rmtoll CR          RST_HEALTH_FLAGS       LL_RNG_SetResetHealthErrorFlags
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_CR_RST_HEALTH_FLAGS_0
  *         @arg LL_RNG_CR_RST_HEALTH_FLAGS_1
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetResetHealthErrorFlags(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->CR, RNG_CR_RST_HEALTH_FLAGS, value);
}

/**
  * @brief  Get the Reset Health Error Flag
    @note   When writing a 1, the value remains until it is seen by RNG core clock domain after resynchronization.
     Then it is automatically reset
            0x0 no reset
  * @rmtoll CR          RST_HEALTH_FLAGS       LL_RNG_GetResetHealthErrorFlags
  * @retval can be one of the following values
  *         @arg LL_RNG_CR_RST_HEALTH_FLAGS_0
  *         @arg LL_RNG_CR_RST_HEALTH_FLAGS_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetResetHealthErrorFlags(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->CR, RNG_CR_RST_HEALTH_FLAGS));
}

/**
  * @brief  Set the sampling clock enable divider
    @note   dividing by a factor equal to CLKDIV[15:0] + 1, values being in the range of 0 to 65535
  * @rmtoll CR          CLKDIV_15_0       LL_RNG_SetSamplingClockEnableDivider
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 65535 (form 0x0 to 0xffff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetSamplingClockEnableDivider(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->CR, RNG_CR_CLKDIV_15_0, value << RNG_CR_CLKDIV_15_0_Pos);
}

/**
  * @brief  Get the sampling clock enable divider
    @note   dividing by a factor equal to CLKDIV[15:0] + 1, values being in the range of 0 to 65535
  * @rmtoll CR          CLKDIV_15_0       LL_RNG_GetSamplingClockEnableDivider
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetSamplingClockEnableDivider(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->CR, RNG_CR_CLKDIV_15_0) >> RNG_CR_CLKDIV_15_0_Pos);
}


/**
  * @brief  Indicate if DISABLED value Flag is set or not.
  * @note   RNG is disabled
  *         0x0 Normal operation.
  *         0x1 RNG is disabled
  * @rmtoll SR          DISABLED            LL_RNG_IsActiveFlag_DISABLED
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_DISABLED(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_DISABLED) == (RNG_SR_DISABLED)) ? 1U : 0U);
}

/**
  * @brief  Indicate if ALL_OSCS_DOWN value Flag is set or not.
  * @note   All oscillators of the random source noise have been powered down
  *         This can cause the rising of OEC3 flag
  *         0x0 At least one oscillator is ON0x1 All oscillators are down
  * @rmtoll SR          ALL_OSCS_DOWN            LL_RNG_IsActiveFlag_ALL_OSCS_DOWN
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_ALL_OSCS_DOWN(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_ALL_OSCS_DOWN) == (RNG_SR_ALL_OSCS_DOWN)) ? 1U : 0U);
}

/**
  * @brief  Indicate if REVEAL_CLK_ERR value Flag is set or not.
  * @note   The internal clock for the RNG core is not revealed
  *         0x0 Internal clock for RNG clock is present.
  *         0x1 Internal RNG clock is not present
  * @rmtoll SR          REVEAL_CLK_ERR            LL_RNG_IsActiveFlag_REVEAL_CLK_ERR
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_REVEAL_CLK_ERR(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_REVEAL_CLK_ERR) == (RNG_SR_REVEAL_CLK_ERR)) ? 1U : 0U);
}

/**
  * @brief  Indicate if ENTROPY_ERR value Flag is set or not.
  * @note   The error refers to a fault in the bit sequence detected by the Entropy Monitor. Failed test is
  given by REPET_ERROR, and ADAPT_ERROR, OSCS_REPET_ERROR and OSCS_ADAPT_ERROR status flags
  *         0x0 No fault detected
  *         0x1 Embedded heath monitor detects an error in bit stream quality
  * @rmtoll SR          ENTROPY_ERR            LL_RNG_IsActiveFlag_ENTROPY_ERR
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_ENTROPY_ERR(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_ENTROPY_ERR) == (RNG_SR_ENTROPY_ERR)) ? 1U : 0U);
}

/**
  * @brief  Indicate if VAL_READY value Flag is set or not.
  * @note   At least one 32-bit random value is available in the data FIFO
  *         Note that application must ensure that a random is available in internal FIFO before starting a
  read otherwise a bus error will be generated
  *         0x0 No value is ready in FIFO.
  *         0x1 A 32-bit value is available in the internal FIFO
  * @rmtoll SR          VAL_READY            LL_RNG_IsActiveFlag_VAL_READY
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_VAL_READY(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_VAL_READY) == (RNG_SR_VAL_READY)) ? 1U : 0U);
}


/**
  * @brief  Indicate if FIFO_FULL value Flag is set or not.
  * @note   Indicates whether random data FIFO is full
  *         0x0 FIFO is not full.
  *         0x1 The internal data FIFO is full and four 32-bit random values can be read
  * @rmtoll SR          FIFO_FULL            LL_RNG_IsActiveFlag_FIFO_FULL
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_FIFO_FULL(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_FIFO_FULL) == (RNG_SR_FIFO_FULL)) ? 1U : 0U);
}

/**
  * @brief  Indicate if SRC_HEALTH_DONE value Flag is set or not.
  * @note   First run of noise source health test is completed
  * @rmtoll SR          SRC_HEALTH_DONE            LL_RNG_IsActiveFlag_SRC_HEALTH_DONE
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_SRC_HEALTH_DONE(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_SRC_HEALTH_DONE) == (RNG_SR_SRC_HEALTH_DONE)) ? 1U : 0U);
}

/**
  * @brief  Indicate if REPET_ERROR value Flag is set or not.
  * @note   Noise source Repetition health test error
  * @rmtoll SR          REPET_ERROR            LL_RNG_IsActiveFlag_REPET_ERROR
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_REPET_ERROR(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_REPET_ERROR) == (RNG_SR_REPET_ERROR)) ? 1U : 0U);
}

/**
  * @brief  Indicate if ADAPT_ERROR value Flag is set or not.
  * @note   Noise source Adaptive 1024 health test error
  * @rmtoll SR          ADAPT_ERROR            LL_RNG_IsActiveFlag_ADAPT_ERROR
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_ADAPT_ERROR(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_ADAPT_ERROR) == (RNG_SR_ADAPT_ERROR)) ? 1U : 0U);
}

/**
  * @brief  Indicate if OSCS_HEALTH_DONE value Flag is set or not.
  * @note   First run of source health tests of individual oscillators composing the noise source are completed
  * @rmtoll SR          OSCS_HEALTH_DONE            LL_RNG_IsActiveFlag_OSCS_HEALTH_DONE
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_OSCS_HEALTH_DONE(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_OSCS_HEALTH_DONE) == (RNG_SR_OSCS_HEALTH_DONE)) ? 1U : 0U);
}

/**
  * @brief  Indicate if OSCS_REPET_ERROR value Flag is set or not.
  * @note   Logical OR of repetition health test errors of individual oscillators composing the noise source
  * @rmtoll SR          OSCS_REPET_ERROR            LL_RNG_IsActiveFlag_OSCS_REPET_ERROR
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_OSCS_REPET_ERROR(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_OSCS_REPET_ERROR) == (RNG_SR_OSCS_REPET_ERROR)) ? 1U : 0U);
}

/**
  * @brief  Indicate if OSCS_ADAPT_ERROR value Flag is set or not.
  * @note   Logical OR of adaptive health test errors of individual oscillators composing the noise source
  * @rmtoll SR          OSCS_ADAPT_ERROR            LL_RNG_IsActiveFlag_OSCS_ADAPT_ERROR
  * @param  RNGx RNG Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RNG_IsActiveFlag_OSCS_ADAPT_ERROR(RNG_TypeDef *RNGx)
{
  return ((READ_BIT(RNGx->SR, RNG_SR_OSCS_ADAPT_ERROR) == (RNG_SR_OSCS_ADAPT_ERROR)) ? 1U : 0U);
}


/**
  * @brief  Get the RND_VAL is a 32-bit Random Value
  * @note   This is the output of the internal four-word FIFO. Note that application must ensure that a random is
  available in FIFO by ready VAL_READY flag before starting a read otherwise a null value will be returned
  * @rmtoll VAL          RND_VAL       LL_RNG_GetRndVal
  * @retval a 32-bit Random Value
  */
__STATIC_INLINE uint32_t LL_RNG_GetRndVal(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->VAL, RNG_VAL_RND_VAL) >> RNG_VAL_RND_VAL_Pos);
}

#define LL_RNG_READRANDDATA32 LL_RNG_GetRndVal

/**
  * @brief  Set the Power down of individual oscillators in triple-oscillator block number 1
  * @rmtoll OSCS_CR          PWRD1       LL_RNG_SetPowerDownBlock1
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_OSCS_CR_PWRD1_0
  *         @arg LL_RNG_OSCS_CR_PWRD1_1
  *         @arg LL_RNG_OSCS_CR_PWRD1_2
  *         @arg LL_RNG_OSCS_CR_PWRD1_3
  *         @arg LL_RNG_OSCS_CR_PWRD1_4
  *         @arg LL_RNG_OSCS_CR_PWRD1_5
  *         @arg LL_RNG_OSCS_CR_PWRD1_6
  *         @arg LL_RNG_OSCS_CR_PWRD1_7
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetPowerDownBlock1(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->OSCS_CR, RNG_OSCS_CR_PWRD1, value);
}

/**
  * @brief  Get the Power down of individual oscillators in triple-oscillator block number 1
  * @rmtoll OSCS_CR          PWRD1       LL_RNG_GetPowerDownBlock1
  * @retval can be one of the following values
  *         @arg LL_RNG_OSCS_CR_PWRD1_0
  *         @arg LL_RNG_OSCS_CR_PWRD1_1
  *         @arg LL_RNG_OSCS_CR_PWRD1_2
  *         @arg LL_RNG_OSCS_CR_PWRD1_3
  *         @arg LL_RNG_OSCS_CR_PWRD1_4
  *         @arg LL_RNG_OSCS_CR_PWRD1_5
  *         @arg LL_RNG_OSCS_CR_PWRD1_6
  *         @arg LL_RNG_OSCS_CR_PWRD1_7
  */
__STATIC_INLINE uint32_t LL_RNG_GetPowerDownBlock1(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->OSCS_CR, RNG_OSCS_CR_PWRD1));
}

/**
  * @brief  Set the Power down of individual oscillators in triple-oscillator block number 2
  * @rmtoll OSCS_CR          PWRD2       LL_RNG_SetPowerDownBlock2
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_OSCS_CR_PWRD2_0
  *         @arg LL_RNG_OSCS_CR_PWRD2_1
  *         @arg LL_RNG_OSCS_CR_PWRD2_2
  *         @arg LL_RNG_OSCS_CR_PWRD2_3
  *         @arg LL_RNG_OSCS_CR_PWRD2_4
  *         @arg LL_RNG_OSCS_CR_PWRD2_5
  *         @arg LL_RNG_OSCS_CR_PWRD2_6
  *         @arg LL_RNG_OSCS_CR_PWRD2_7
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetPowerDownBlock2(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->OSCS_CR, RNG_OSCS_CR_PWRD2, value);
}

/**
  * @brief  Get the Power down of individual oscillators in triple-oscillator block number 2
  * @rmtoll OSCS_CR          PWRD2       LL_RNG_GetPowerDownBlock2
  * @retval can be one of the following values
  *         @arg LL_RNG_OSCS_CR_PWRD2_0
  *         @arg LL_RNG_OSCS_CR_PWRD2_1
  *         @arg LL_RNG_OSCS_CR_PWRD2_2
  *         @arg LL_RNG_OSCS_CR_PWRD2_3
  *         @arg LL_RNG_OSCS_CR_PWRD2_4
  *         @arg LL_RNG_OSCS_CR_PWRD2_5
  *         @arg LL_RNG_OSCS_CR_PWRD2_6
  *         @arg LL_RNG_OSCS_CR_PWRD2_7
  */
__STATIC_INLINE uint32_t LL_RNG_GetPowerDownBlock2(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->OSCS_CR, RNG_OSCS_CR_PWRD2));
}

/**
  * @brief  Set the Power down of individual oscillators in triple-oscillator block number 3
  * @rmtoll OSCS_CR          PWRD3       LL_RNG_SetPowerDownBlock3
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_OSCS_CR_PWRD3_0
  *         @arg LL_RNG_OSCS_CR_PWRD3_1
  *         @arg LL_RNG_OSCS_CR_PWRD3_2
  *         @arg LL_RNG_OSCS_CR_PWRD3_3
  *         @arg LL_RNG_OSCS_CR_PWRD3_4
  *         @arg LL_RNG_OSCS_CR_PWRD3_5
  *         @arg LL_RNG_OSCS_CR_PWRD3_6
  *         @arg LL_RNG_OSCS_CR_PWRD3_7
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetPowerDownBlock3(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->OSCS_CR, RNG_OSCS_CR_PWRD3, value);
}

/**
  * @brief  Get the Power down of individual oscillators in triple-oscillator block number 3
  * @rmtoll OSCS_CR          PWRD3       LL_RNG_GetPowerDownBlock3
  * @retval can be one of the following values
  *         @arg LL_RNG_OSCS_CR_PWRD3_0
  *         @arg LL_RNG_OSCS_CR_PWRD3_1
  *         @arg LL_RNG_OSCS_CR_PWRD3_2
  *         @arg LL_RNG_OSCS_CR_PWRD3_3
  *         @arg LL_RNG_OSCS_CR_PWRD3_4
  *         @arg LL_RNG_OSCS_CR_PWRD3_5
  *         @arg LL_RNG_OSCS_CR_PWRD3_6
  *         @arg LL_RNG_OSCS_CR_PWRD3_7
  */
__STATIC_INLINE uint32_t LL_RNG_GetPowerDownBlock3(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->OSCS_CR, RNG_OSCS_CR_PWRD3));
}

/**
  * @brief  Set the When set, selection of resynchronized output of oscillators
  * @note   It is recommended to disable RNG before changing this value
  * @rmtoll OSCS_CR          SYNC_OSCS       LL_RNG_SetSyncOscs
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_OSCS_CR_SYNC_OSCS_0
  *         @arg LL_RNG_OSCS_CR_SYNC_OSCS_1
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetSyncOscs(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->OSCS_CR, RNG_OSCS_CR_SYNC_OSCS, value);
}

/**
  * @brief  Get the When set, selection of resynchronized output of oscillators
  * @note   It is recommended to disable RNG before changing this value
  * @rmtoll OSCS_CR          SYNC_OSCS       LL_RNG_GetSyncOscs
  * @retval can be one of the following values
  *         @arg LL_RNG_OSCS_CR_SYNC_OSCS_0
  *         @arg LL_RNG_OSCS_CR_SYNC_OSCS_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetSyncOscs(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->OSCS_CR, RNG_OSCS_CR_SYNC_OSCS));
}

/**
  * @brief  Set the Reset AES post processing
  * @note   When writing a 1, the AES post processing is reinitialized, resulting in a new key and new state
  generation before 128-bit random words generation. The 1 written is frozen until it is seen by RNG core clock domain
  after resynchronization. Then it is automatically reset. It also reruns analog source health tests0x0 No effect0x1
  Reset AES core
  * @rmtoll POSTP_CR          AES_RESET       LL_RNG_SetAesReset
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_POSTP_CR_AES_RESET_0
  *         @arg LL_RNG_POSTP_CR_AES_RESET_1
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetAesReset(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->POSTP_CR, RNG_POSTP_CR_AES_RESET, value);
}

/**
  * @brief  Get the Reset AES post processing
  * @note   When writing a 1, the AES post processing is reinitialized, resulting in a new key and new state
  generation before 128-bit random words generation. The 1 written is frozen until it is seen by RNG core clock
  domain after resynchronization. Then it is automatically reset. It also reruns analog source health tests0x0 No
  effect0x1 Reset AES core
  * @rmtoll POSTP_CR          AES_RESET       LL_RNG_GetAesReset
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_CR_AES_RESET_0
  *         @arg LL_RNG_POSTP_CR_AES_RESET_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesReset(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_CR, RNG_POSTP_CR_AES_RESET));
}

/**
  * @brief  Set the NB_LOOP_AES is the number of 128-bit words got from the noise source that have to be processed
  by AES for generating a single 128-bit random word
  * @note   By default, this value is set to 2 (128 bits generated before an AES processing).A new AES processing
 is started only when the previous one is completed.0: value means 16 loops
  * @rmtoll POSTP_CR          NB_LOOP_AES       LL_RNG_SetNbLoopAes
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_0
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_1
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_2
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_3
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_4
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_5
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_6
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_7
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_8
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_9
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_10
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_11
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_12
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_13
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_14
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_15
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetNbLoopAes(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->POSTP_CR, RNG_POSTP_CR_NB_LOOP_AES, value);
}

/**
  * @brief  Get the NB_LOOP_AES is the number of 128-bit words got from the noise source that have to be processed by
  AES for generating a single 128-bit random word
  * @note   By default, this value is set to 2 (128 bits generated before an AES processing).A new AES processing is
  started only when the previous one is completed.0: value means 16 loops
  * @rmtoll POSTP_CR          NB_LOOP_AES       LL_RNG_GetNbLoopAes
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_0
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_1
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_2
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_3
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_4
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_5
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_6
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_7
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_8
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_9
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_10
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_11
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_12
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_13
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_14
  *         @arg LL_RNG_POSTP_CR_NB_LOOP_AES_15
  */
__STATIC_INLINE uint32_t LL_RNG_GetNbLoopAes(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_CR, RNG_POSTP_CR_NB_LOOP_AES));
}

/**
  * @brief  Set the Number of 128-bit random words generated before AES automatically resets
  * @note   This number is in the range of 1 to 65535 words. Value 0x0000 means that AES is never reinitialized
  * @rmtoll POSTP_CR          NB_RND_REINIT       LL_RNG_SetNbRndReinit
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 65535 (form 0x0 to 0xffff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetNbRndReinit(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->POSTP_CR, RNG_POSTP_CR_NB_RND_REINIT, value << RNG_POSTP_CR_NB_RND_REINIT_Pos);
}

/**
  * @brief  Get the Number of 128-bit random words generated before AES automatically resets
  * @note   This number is in the range of 1 to 65535 words. Value 0x0000 means that AES is never reinitialized
  * @rmtoll POSTP_CR          NB_RND_REINIT       LL_RNG_GetNbRndReinit
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetNbRndReinit(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_CR, RNG_POSTP_CR_NB_RND_REINIT) >> RNG_POSTP_CR_NB_RND_REINIT_Pos);
}

/**
  * @brief  Get the AES Post processing has been fully initialized (key and state) and is ready for generating 128-bit
  random words
  * @note   0x0 AES core is not initialized (no key or state set).0x1 AES core is fully initialized
  * @rmtoll POSTP_SR          AES_INIT       LL_RNG_GetAesInit
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_SR_AES_INIT_0
  *         @arg LL_RNG_POSTP_SR_AES_INIT_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesInit(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_SR, RNG_POSTP_SR_AES_INIT));
}

/**
  * @brief  Get the AES random key has been generated and loaded in AES key register
  * @note   0x0 AES core is waiting for 128 random bits from the entropy sources for generating its key0x1 AES key
  register has been loaded with a random key
  * @rmtoll POSTP_SR          AES_KEY_LD       LL_RNG_GetAesKeyLd
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_SR_AES_KEY_LD_0
  *         @arg LL_RNG_POSTP_SR_AES_KEY_LD_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesKeyLd(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_SR, RNG_POSTP_SR_AES_KEY_LD));
}

