stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_rng.h
/**
  * @brief  Get the AES core is busy, generating a random value
  * @note   0x0 AES core is idle0x1 AES core is busy
  * @rmtoll POSTP_SR          AES_BUSY       LL_RNG_GetAesBusy
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_SR_AES_BUSY_0
  *         @arg LL_RNG_POSTP_SR_AES_BUSY_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesBusy(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_SR, RNG_POSTP_SR_AES_BUSY));
}

/**
  * @brief  Get the AES-CMAC health test is completed
  * @rmtoll POSTP_SR          AES_HEALTH_DONE       LL_RNG_GetAesHealthDone
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_SR_AES_HEALTH_DONE_0
  *         @arg LL_RNG_POSTP_SR_AES_HEALTH_DONE_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesHealthDone(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_SR, RNG_POSTP_SR_AES_HEALTH_DONE));
}

/**
  * @brief  Get the Health test error on AES-CMAC sub-keys generation
  * @rmtoll POSTP_SR          AES_K12_ERROR       LL_RNG_GetAesK12Error
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_SR_AES_K12_ERROR_0
  *         @arg LL_RNG_POSTP_SR_AES_K12_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesK12Error(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_SR, RNG_POSTP_SR_AES_K12_ERROR));
}

/**
  * @brief  Get the Health test error on AES-CMAC output generation
  * @rmtoll POSTP_SR          AES_DOUT_ERROR       LL_RNG_GetAesDoutError
  * @retval can be one of the following values
  *         @arg LL_RNG_POSTP_SR_AES_DOUT_ERROR_0
  *         @arg LL_RNG_POSTP_SR_AES_DOUT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetAesDoutError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->POSTP_SR, RNG_POSTP_SR_AES_DOUT_ERROR));
}

/**
  * @brief  Set the Bits 31 to 0 of AES 128-bit Default Key
  * @rmtoll DEFKEY0          RNG_DEFKEY0       LL_RNG_SetRngDefkey0
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 4294967295 (form 0x0 to 0xffffffff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRngDefkey0(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->DEFKEY0, RNG_DEFKEY0_RNG_DEFKEY0, value << RNG_DEFKEY0_RNG_DEFKEY0_Pos);
}

/**
  * @brief  Get the Bits 31 to 0 of AES 128-bit Default Key
  * @rmtoll DEFKEY0          RNG_DEFKEY0       LL_RNG_GetRngDefkey0
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRngDefkey0(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->DEFKEY0, RNG_DEFKEY0_RNG_DEFKEY0) >> RNG_DEFKEY0_RNG_DEFKEY0_Pos);
}

/**
  * @brief  Set the Bits 63 to 31 of AES 128-bit Default Key
  * @rmtoll DEFKEY1          RNG_DEFKEY1       LL_RNG_SetRngDefkey1
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 4294967295 (form 0x0 to 0xffffffff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRngDefkey1(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->DEFKEY1, RNG_DEFKEY1_RNG_DEFKEY1, value << RNG_DEFKEY1_RNG_DEFKEY1_Pos);
}

/**
  * @brief  Get the Bits 63 to 31 of AES 128-bit Default Key
  * @rmtoll DEFKEY1          RNG_DEFKEY1       LL_RNG_GetRngDefkey1
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRngDefkey1(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->DEFKEY1, RNG_DEFKEY1_RNG_DEFKEY1) >> RNG_DEFKEY1_RNG_DEFKEY1_Pos);
}

/**
  * @brief  Set the Bits 95 to 64 of AES 128-bit Default Key
  * @rmtoll DEFKEY2          RNG_DEFKEY2       LL_RNG_SetRngDefkey2
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 4294967295 (form 0x0 to 0xffffffff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRngDefkey2(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->DEFKEY2, RNG_DEFKEY2_RNG_DEFKEY2, value << RNG_DEFKEY2_RNG_DEFKEY2_Pos);
}

/**
  * @brief  Get the Bits 95 to 64 of AES 128-bit Default Key
  * @rmtoll DEFKEY2          RNG_DEFKEY2       LL_RNG_GetRngDefkey2
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRngDefkey2(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->DEFKEY2, RNG_DEFKEY2_RNG_DEFKEY2) >> RNG_DEFKEY2_RNG_DEFKEY2_Pos);
}

/**
  * @brief  Set the Bits 127 to 96 of AES 128-bit Default Key
  * @rmtoll DEFKEY3          RNG_DEFKEY3       LL_RNG_SetRngDefkey3
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 4294967295 (form 0x0 to 0xffffffff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRngDefkey3(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->DEFKEY3, RNG_DEFKEY3_RNG_DEFKEY3, value << RNG_DEFKEY3_RNG_DEFKEY3_Pos);
}

/**
  * @brief  Get the Bits 127 to 96 of AES 128-bit Default Key
  * @rmtoll DEFKEY3          RNG_DEFKEY3       LL_RNG_GetRngDefkey3
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRngDefkey3(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->DEFKEY3, RNG_DEFKEY3_RNG_DEFKEY3) >> RNG_DEFKEY3_RNG_DEFKEY3_Pos);
}

/**
  * @brief  Set the Cutoff value of Repetition Test
  * @note   The default value is set to 51. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_CR          REPET_CUTOFF       LL_RNG_SetRepetCutoff
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 255 (form 0x0 to 0xff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRepetCutoff(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_CR, RNG_HEALTH_CR_REPET_CUTOFF, value << RNG_HEALTH_CR_REPET_CUTOFF_Pos);
}

/**
  * @brief  Get the Cutoff value of Repetition Test
  * @note   The default value is set to 51. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_CR          REPET_CUTOFF       LL_RNG_GetRepetCutoff
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRepetCutoff(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_CR, RNG_HEALTH_CR_REPET_CUTOFF) >> RNG_HEALTH_CR_REPET_CUTOFF_Pos);
}

/**
  * @brief  Set the Cutoff value of Adaptive Test
  * @note   The default value is set to 699. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_CR          ADAP_CUTOFF       LL_RNG_SetAdapCutoff
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 1023 (form 0x0 to 0x3ff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetAdapCutoff(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_CR, RNG_HEALTH_CR_ADAP_CUTOFF, value << RNG_HEALTH_CR_ADAP_CUTOFF_Pos);
}

/**
  * @brief  Get the Cutoff value of Adaptive Test
  * @note   The default value is set to 699. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_CR          ADAP_CUTOFF       LL_RNG_GetAdapCutoff
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetAdapCutoff(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_CR, RNG_HEALTH_CR_ADAP_CUTOFF) >> RNG_HEALTH_CR_ADAP_CUTOFF_Pos);
}

/**
  * @brief  Set the Number of iterations minus 1 of Adaptive test during initialization phase
  * @note   Default value is set to 0 i.e. 1 iteration
  * @rmtoll HEALTH_CR          ITER_ADAP       LL_RNG_SetIterAdap
  * @param  RNGx RNG Instance
  * @param  value can be one of the following values:
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_0
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_1
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_2
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_3
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetIterAdap(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_CR, RNG_HEALTH_CR_ITER_ADAP, value);
}

/**
  * @brief  Get the Number of iterations minus 1 of Adaptive test during initialization phase
  * @note   Default value is set to 0 i.e. 1 iteration
  * @rmtoll HEALTH_CR          ITER_ADAP       LL_RNG_GetIterAdap
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_0
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_1
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_2
  *         @arg LL_RNG_HEALTH_CR_ITER_ADAP_3
  */
__STATIC_INLINE uint32_t LL_RNG_GetIterAdap(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_CR, RNG_HEALTH_CR_ITER_ADAP));
}

/**
  * @brief  Set the Cutoff value of Repetition Test
  * @note   The default value is set to 51. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC1_CR          REPET_CUTOFF_OSC1       LL_RNG_SetRepetCutoffOsc1
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 255 (form 0x0 to 0xff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRepetCutoffOsc1(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_OSC1_CR, RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1,
             value << RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos);
}

/**
  * @brief  Get the Cutoff value of Repetition Test
  * @note   The default value is set to 51. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC1_CR          REPET_CUTOFF_OSC1       LL_RNG_GetRepetCutoffOsc1
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRepetCutoffOsc1(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_CR,
                             RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1) >> RNG_HEALTH_OSC1_CR_REPET_CUTOFF_OSC1_Pos);
}

/**
  * @brief  Set the Cutoff value of Adaptive Test
  * @note   The default value is set to 699. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC1_CR          ADAP_CUTOFF_OSC1       LL_RNG_SetAdapCutoffOsc1
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 1023 (form 0x0 to 0x3ff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetAdapCutoffOsc1(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_OSC1_CR, RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1,
             value << RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos);
}

/**
  * @brief  Get the Cutoff value of Adaptive Test
  * @note   The default value is set to 699. Caution: To be handled with care as any change can lead to misbehavior
  of RNG
  * @rmtoll HEALTH_OSC1_CR          ADAP_CUTOFF_OSC1       LL_RNG_GetAdapCutoffOsc1
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetAdapCutoffOsc1(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_CR,
                             RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1) >> RNG_HEALTH_OSC1_CR_ADAP_CUTOFF_OSC1_Pos);
}

/**
  * @brief  Set the Cutoff value of Repetition Test
  * @note   The default value is set to 51.Caution: To be handled with care as any change can lead to misbehavior
  of RNG
  * @rmtoll HEALTH_OSC2_CR          REPET_CUTOFF_OSC2       LL_RNG_SetRepetCutoffOsc2
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 255 (form 0x0 to 0xff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRepetCutoffOsc2(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_OSC2_CR, RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2,
             value << RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos);
}

/**
  * @brief  Get the Cutoff value of Repetition Test
  * @note   The default value is set to 51.Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC2_CR          REPET_CUTOFF_OSC2       LL_RNG_GetRepetCutoffOsc2
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRepetCutoffOsc2(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_CR,
                             RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2) >> RNG_HEALTH_OSC2_CR_REPET_CUTOFF_OSC2_Pos);
}

/**
  * @brief  Set the Cutoff value of Adaptive Test
  * @note   The default value is set to 699.Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC2_CR          ADAP_CUTOFF_OSC2       LL_RNG_SetAdapCutoffOsc2
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 1023 (form 0x0 to 0x3ff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetAdapCutoffOsc2(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_OSC2_CR, RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2,
             value << RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos);
}

/**
  * @brief  Get the Cutoff value of Adaptive Test
  * @note   The default value is set to 699.Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC2_CR          ADAP_CUTOFF_OSC2       LL_RNG_GetAdapCutoffOsc2
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetAdapCutoffOsc2(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_CR,
                             RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2) >> RNG_HEALTH_OSC2_CR_ADAP_CUTOFF_OSC2_Pos);
}

/**
  * @brief  Set the Cutoff value of Repetition Test
  * @note   The default value is set to 51.Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC3_CR          REPET_CUTOFF_OSC3       LL_RNG_SetRepetCutoffOsc3
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 255 (form 0x0 to 0xff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetRepetCutoffOsc3(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_OSC3_CR, RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3,
             value << RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos);
}

/**
  * @brief  Get the Cutoff value of Repetition Test
  * @note   The default value is set to 51.Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC3_CR          REPET_CUTOFF_OSC3       LL_RNG_GetRepetCutoffOsc3
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetRepetCutoffOsc3(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC3_CR,
                             RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3) >> RNG_HEALTH_OSC3_CR_REPET_CUTOFF_OSC3_Pos);
}

/**
  * @brief  Set the Cutoff value of Adaptive Test
  * @note   The default value is set to 699. Caution: To be handled with care as any change can lead to misbehavior of
  RNG
  * @rmtoll HEALTH_OSC3_CR          ADAP_CUTOFF_OSC3       LL_RNG_SetAdapCutoffOsc3
  * @param  RNGx RNG Instance
  * @param  value parameter must be a number between 0 and 1023 (form 0x0 to 0x3ff)
  * @retval None
  */
__STATIC_INLINE void LL_RNG_SetAdapCutoffOsc3(RNG_TypeDef *RNGx, uint32_t value)
{
  MODIFY_REG(RNGx->HEALTH_OSC3_CR, RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3,
             value << RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos);
}

/**
  * @brief  Get the Cutoff value of Adaptive Test
  * @note   The default value is set to 699. Caution: To be handled with care as any change can lead to misbehavior
  of RNG
  * @rmtoll HEALTH_OSC3_CR          ADAP_CUTOFF_OSC3       LL_RNG_GetAdapCutoffOsc3
  * @retval can be one of the following values
  */
__STATIC_INLINE uint32_t LL_RNG_GetAdapCutoffOsc3(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC3_CR,
                             RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3) >> RNG_HEALTH_OSC3_CR_ADAP_CUTOFF_OSC3_Pos);
}

/**
  * @brief  Get the Repetition error flag of first oscillator of first triple-oscillator cell
  * @rmtoll HEALTH_OSC1_SR          TO1_REPET_ERROR       LL_RNG_GetOSC1_To1RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC1_To1RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_SR, RNG_HEALTH_OSC1_SR_TO1_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of first triple-oscillator cell
  * @rmtoll HEALTH_OSC1_SR          TO1_ADAPT_ERROR       LL_RNG_GetOSC1_To1AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC1_To1AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_SR, RNG_HEALTH_OSC1_SR_TO1_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag of first oscillator of second triple-oscillator cell
  * @rmtoll HEALTH_OSC1_SR          TO2_REPET_ERROR       LL_RNG_GetOSC_To2RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC_To2RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_SR, RNG_HEALTH_OSC1_SR_TO2_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of second triple-oscillator cell
  * @rmtoll HEALTH_OSC1_SR          TO2_ADAPT_ERROR       LL_RNG_GetOSC_To2AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC_To2AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_SR, RNG_HEALTH_OSC1_SR_TO2_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag of first oscillator of third triple-oscillator cell
  * @rmtoll HEALTH_OSC1_SR          TO3_REPET_ERROR       LL_RNG_GetTo3RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetTo3RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_SR, RNG_HEALTH_OSC1_SR_TO3_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of third triple-oscillator cell
  * @rmtoll HEALTH_OSC1_SR          TO3_ADAPT_ERROR       LL_RNG_GetTo3AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetTo3AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC1_SR, RNG_HEALTH_OSC1_SR_TO3_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag
  * @note   Repetition error flag of first oscillator of first triple-oscillator cell
  * @rmtoll HEALTH_OSC2_SR          TO1_REPET_ERROR       LL_RNG_GetOSC2_To1RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC2_To1RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_SR, RNG_HEALTH_OSC2_SR_TO1_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag
  * @note   Adaptive error flag of first oscillator of first triple-oscillator cell
  * @rmtoll HEALTH_OSC2_SR          TO1_ADAPT_ERROR       LL_RNG_GetOSC2_To1AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC2_To1AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_SR, RNG_HEALTH_OSC2_SR_TO1_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag of first oscillator of second triple-oscillator cell
  * @rmtoll HEALTH_OSC2_SR          TO2_REPET_ERROR       LL_RNG_GetOSC2_To2RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC2_To2RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_SR, RNG_HEALTH_OSC2_SR_TO2_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of second triple-oscillator cell
  * @rmtoll HEALTH_OSC2_SR          TO2_ADAPT_ERROR       LL_RNG_GetOSC2_To2AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC2_To2AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_SR, RNG_HEALTH_OSC2_SR_TO2_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag of first oscillator of third triple-oscillator cell
  * @rmtoll HEALTH_OSC2_SR          TO3_REPET_ERROR       LL_RNG_GetOSC2_To3RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_OSC2_GetTo3RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_SR, RNG_HEALTH_OSC2_SR_TO3_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of third triple-oscillator cell
  * @rmtoll HEALTH_OSC2_SR          TO3_ADAPT_ERROR       LL_RNG_GetOSC2_To3AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC2_To3AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC2_SR, RNG_HEALTH_OSC2_SR_TO3_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag of third oscillator of first triple-oscillator cell
  * @rmtoll HEALTH_OSC3_SR          TO1_REPET_ERROR       LL_RNG_GetOSC3_To1RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO1_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO1_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC3_To1RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC3_SR, RNG_HEALTH_OSC3_SR_TO1_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of first triple-oscillator cell
  * @rmtoll HEALTH_OSC3_SR          TO1_ADAPT_ERROR       LL_RNG_GetOSC3_To1AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO1_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO1_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC3_To1AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC3_SR, RNG_HEALTH_OSC3_SR_TO1_ADAPT_ERROR));
}

/**
  * @brief  Get the Repetition error flag of first oscillator of second triple-oscillator cell
  * @rmtoll HEALTH_OSC3_SR          TO2_REPET_ERROR       LL_RNG_GetOSC3_To2RepetError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO2_REPET_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO2_REPET_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC3_To2RepetError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC3_SR, RNG_HEALTH_OSC3_SR_TO2_REPET_ERROR));
}

/**
  * @brief  Get the Adaptive error flag of first oscillator of second triple-oscillator cell
  * @rmtoll HEALTH_OSC3_SR          TO2_ADAPT_ERROR       LL_RNG_GetOSC3_To2AdaptError
  * @retval can be one of the following values
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO2_ADAPT_ERROR_0
  *         @arg LL_RNG_HEALTH_OSC3_SR_TO2_ADAPT_ERROR_1
  */
__STATIC_INLINE uint32_t LL_RNG_GetOSC3_To2AdaptError(RNG_TypeDef *RNGx)
{
  return (uint32_t)(READ_BIT(RNGx->HEALTH_OSC3_SR, RNG_HEALTH_OSC3_SR_TO2_ADAPT_ERROR));
}

